Repository: aehp20/nx-i18n
Catalog: locale/*.po
Languages: es, fr

source: Document
es: Documento

source: This is my i18n lib
es: Esta es mi libreria de traduction
fr: Ceci est ma i18n lib

source: This {object} is a new entity
es: Este {object} es una nueva entidad
fr: Ce {object} est une entité

source: Hello
es: Hola
fr: Salut

source: How are you?
es: Como estas ?
fr: Comment çava?

source: Thanks
es: Gracias
fr: Merci

source: I have one car
es: Yo tengo un auto
fr: J'ai une voiture

source: {uno} and {dos} have one car
es: {uno} y {dos} tienen un carro
fr: {uno} et {dos} ont une voiture

# ExampleContext
source: This message is under a context
es: Este mensage esta bajo un contexto
fr: Ce message est sous un contexte

# ExampleContext
source: This {data} is under a context
es: Este {data} esta bajo un contexto
fr: Cette {data} est sous un contexte

# ExampleContext
source: This {object} is under a context
es: Este {object} esta bajo un contexto
fr: Ce {object} est sous un contexte

# NewContext
source: Document
es: Documento

# NewContext
source: Book
es: Libro
fr: Livre

# NewContext
source: My boy {name} has one car
es: Mi hijo {name} tiene un auto
fr: Mon fils {name} a une voiture

source: My name is {firstName}
es: Mi nombre es {firstName}
fr: Mon nom est {firstName}
